#-*- coding:gbk -*-
#filename: retcode.py

#--------------------------------------
#   author : 成协主
#   email:chengxiezhu@iappay.com
#--------------------------------------


#该模块主要是展示返回消息中的返回码对应的文字信息

RetCodeConst = {
    #消息接入错误码，错误码范围1-99
    1:"1：消息结构错",
    2:'2：缺少参数',
    3:'3：命令字不存在',
    4:'4：数据解密出错',
    5:'5：协议版本错误',
    6:'6：流量受限',
    7:'7：交易受限，该平台无调用该接口能力',
    8:'8：IP校验失败',
    9:'9：会话令牌已经失效，需重新建立会话',
    10:'10：业务平台密钥无效',
    11:'11: 用户证书失效',
    12:'12: 客户端无权调用此接口',
    13:'13: 密码格式错误',
    14:'14：数据格式错误(email、手机号码等)',
    15:'15：签名验证失败',
    #用户相关错误，错误码范围100-199
    100:'100：登录密码错误',
    101:'101：用户证书错误',
    102:'102：无效登录名',
    103:'103：用户手机号码已存在，不允许重复绑定',
    104:'104：邮件地址已存在，不允许重复绑定',
    105:'105：该用户无法使用测试中资费',
    106:'106：余额不足',
    107:'107：账户已冻结',
    108:'108：支付密码错误',
    109:'109：用户余额不足，只完成部分支付',
    110:'110：该终端号已经存在,不允许重复绑定	',
    111:'111:该终端号未绑定到指定用户',
    112:'112：账户不存在',
    113:'113：未匹配到mo手机号码',
    114:'114：用户已挂失',
    115:'115：用户未设置密保问题',
    116:'116:验证密保答案错误',
    #业务相关错误，错误码范围200-300
    200:'200：TransID不存在或交易超时',
    201:'201：商家不存在[cpbase]',
    202:'202：商家状态异常',
    203:'203：商品不存在',
    204:'204：商品状态异常',
    223:'223：产品不存在',
    205:'205：计费代码不存在',
    206:'206：计费代码状态异常',
    207:'207：不存在订购关系',
    208:'208：已订购该业务',
    209:'209：订购关系已暂停',
    210:'210：订购关系已欠费暂停',
    211:'211：日消费金额超过上限',
    212:'212：日消费次数超过上限',
    213:'213：月消费次数超过上限',
    214:'214: 月消费金额超过上限',
    215:'215：单次金额超过上限',
    216:'216：同一订单多次支付',
    222:'222：商家信息不存在[cpAttribute]',
    #易宝接口调用失败 [400-450]
    300:'300：网关异常',
    301:'301：卡面额与卡号卡密不一致',
    302:'302：不支持的卡类型或金额',
    303:'303：密码错误或充值卡无效',
    304:'304：卡过期或者已销',
    305:'305：订单号有误或者重复',
    306:'306：卡内余额不足',
    307:'307：本张卡密您提交过于频繁，请您稍后再试',
    308:'308：该卡在同一天连续错误提交',
    309:'309：该卡正在处理中',
    310:'310：该卡已使用',
    311:'311：卡已冻结',
    312:'312：卡未激活',
    # 其它错误[900-999]
    997:'997：当前版本不支持此功能',
    998:'998：系统错误,一般都是数据库异常',
    999:'999：系统错误,系统处理出现异常'
    }

if __name__ == '__main__':
    for k,v in RetCodeConst.items():
        print '错误码是:%d,含义是:%s' %(k,v)
    re = raw_input('按任意键退出...')
